In [19]:
import pandas as pd

cars = pd.read_csv("data/cars.csv")

In [20]:
cars.head()

          Car       Model  Volume  Weight  CO2
0      Toyoty        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [21]:
#get list of categorical variables
s = (cars.dtypes == 'object')
object_cols = list(s[s].index)

print('Categorical variables:')
print(object_cols)

Categorical variables:
['Car', 'Model']

In [1]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
df1 = {
    'Name':['George','Andrea','micheal','maggie','Ravi','Xien','Jalpa',np.nan],
    'State':['Arizona','Georgia','Newyork','Indiana','Florida','California',np.nan,np.nan],
    'Gender':["M","F","M","F","M","M",np.nan,np.nan],      
    'Score':[63,48,56,75,np.nan,77,np.nan,np.nan]
     
   }
 
df1 = pd.DataFrame(df1,columns=['Name','State','Gender','Score'])
print(df1)

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
4     Ravi     Florida      M    NaN
5     Xien  California      M   77.0
6    Jalpa         NaN    NaN    NaN
7      NaN         NaN    NaN    NaN

In [13]:
df1.dropna(inplace=True)

In [10]:
state_index = df1.dropna(thresh=2).dropna(subset=['Score']).set_index(['State'])

In [11]:
state_index.reset_index()

        State     Name Gender  Score
0     Arizona   George      M   63.0
1     Georgia   Andrea      F   48.0
2     Newyork  micheal      M   56.0
3     Indiana   maggie      F   75.0
4  California     Xien      M   77.0

In [14]:
df1

      Name       State Gender  Score
0   George     Arizona      M   63.0
1   Andrea     Georgia      F   48.0
2  micheal     Newyork      M   56.0
3   maggie     Indiana      F   75.0
5     Xien  California      M   77.0

In [16]:
employee_by_gender = df1.pivot_table("Score", index="Name", columns="Gender")

In [17]:
employee_by_gender

Gender      F     M
Name
Andrea   48.0   NaN
George    NaN  63.0
Xien      NaN  77.0
maggie   75.0   NaN
micheal   NaN  56.0

In [23]:
cars.head()

          Car       Model  Volume  Weight  CO2
0      Toyoty        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [31]:
cars_by_model = cars.pivot_table("Volume",index="Car", columns="Weight",fill_value="999")
cars_by_model

Weight,790,865,929,980,990,1109,1112,1119,1140,1150,...,1415,1428,1465,1490,1523,1584,1605,1705,1725,1746
Car,,,,,,,,,,,,,,,,,,,,,
Audi,999,999,999,999,999,999,999,999,999,1600.0,...,999,999,999,2000.0,999,999,999,999,2000.0,999
BMW,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,2000.0,999,999
Fiat,999,900.0,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Ford,999,999,999,999,999,999,1250.0,999,999,999,...,999,999,999,999,999,1600.0,999,999,999,999
Honda,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Hundai,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Hyundai,999,999,999,1100.0,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Mazda,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Mercedes,999,999,999,999,999,999,999,999,999,999,...,999,999,1500.0,999,999,999,2100.0,999,999,999
Mini,999,999,999,999,999,999,999,999,1500.0,999,...,999,999,999,999,999,999,999,999,999,999
Mitsubishi,999,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Opel,999,999,999,999,999,999,999,999,999,999,...,999,2000.0,999,999,999,999,999,999,999,999
Skoda,999,999,1000.0,999,999,1400.0,999,1600.0,999,999,...,1600.0,999,999,999,999,999,999,999,999,999
Suzuki,999,999,999,999,1300.0,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Toyoty,1000.0,999,999,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
VW,999,999,1000.0,999,999,999,999,999,999,999,...,999,999,999,999,999,999,999,999,999,999
Volvo,999,999,999,999,999,999,999,999,999,999,...,2000.0,999,999,999,1600.0,999,999,999,999,2000.0

In [30]:
cars.shape

(36, 5)

In [ ]:
avengers = []